app/controllers/api/V1/airlines_controller.rb

SELECT "airlines".* FROM "airlines"
---
            def index
               @airlines = Airline.all

SELECT "airlines".* FROM "airlines" WHERE "airlines"."slug" = ? LIMIT ?  [["slug", "ethiopian-airlines"], ["LIMIT", 1]]
---
            def show
                airline = Airline.find_by(slug:params[:slug])

INSERT INTO "airlines" ("name", "image_url", "slug", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)
---
            def create
                airline = Airline.new(airline_params)

                if airline.save