app/controllers/api/V1/reviews_controller.rb

            def create
                review = Review.new(review_params)

                if review.save
---
INSERT INTO "reviews" ("title", "description", "score", "airline_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)